<?xml version="1.0"?>
<CastXML format="1.0.0">
  <Namespace id="_1" name="::" members="_2 _3 _4 _5 _6 _7"/>
  <Typedef id="_2" name="__int128_t" type="_8" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_3" name="__uint128_t" type="_9" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_4" name="__NSConstantString" type="_10" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_5" name="__builtin_ms_va_list" type="_11" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_6" name="__builtin_va_list" type="_12" context="_1" location="f0:0" file="f0" line="0"/>
  <Class id="_7" name="MyClass" context="_1" location="f1:1" file="f1" line="1" abstract="1" members="_13 _14 _15 _16 _17 _18 _19 _20" size="128" align="64"/>
  <FundamentalType id="_8" name="__int128" size="128" align="128"/>
  <FundamentalType id="_9" name="unsigned __int128" size="128" align="128"/>
  <Struct id="_10" name="__NSConstantString_tag" context="_1" location="f0:0" file="f0" line="0" members="_21 _22 _23 _24" size="256" align="64"/>
  <PointerType id="_11" type="_25"/>
  <ArrayType id="_12" min="0" max="0" type="_26"/>
  <Field id="_13" name="field" type="_27" context="_7" access="public" location="f1:3" file="f1" line="3" offset="64"/>
  <Method id="_14" name="method" returns="_28" context="_7" access="public" location="f1:4" file="f1" line="4" const="1" virtual="1" pure_virtual="1" mangled="_ZNK7MyClass6methodEv"/>
  <Variable id="_15" name="static_field" type="_27c" context="_7" access="public" location="f1:6" file="f1" line="6" static="1" mangled="_ZN7MyClass12static_fieldE"/>
  <Method id="_16" name="static_method" returns="_27" context="_7" access="public" location="f1:7" file="f1" line="7" static="1" mangled="_ZN7MyClass13static_methodEv"/>
  <OperatorMethod id="_17" name="=" returns="_29" context="_7" access="public" location="f1:1" file="f1" line="1" inline="1" artificial="1" throw="" mangled="_ZN7MyClassaSERKS_">
    <Argument type="_30" location="f1:1" file="f1" line="1"/>
  </OperatorMethod>
  <Destructor id="_18" name="MyClass" context="_7" access="public" location="f1:1" file="f1" line="1" inline="1" artificial="1" throw=""/>
  <Constructor id="_19" name="MyClass" context="_7" access="public" location="f1:1" file="f1" line="1" inline="1" artificial="1" throw=""/>
  <Constructor id="_20" name="MyClass" context="_7" access="public" location="f1:1" file="f1" line="1" inline="1" artificial="1" throw="">
    <Argument type="_30" location="f1:1" file="f1" line="1"/>
  </Constructor>
  <Field id="_21" name="isa" type="_31" context="_10" access="public" offset="0"/>
  <Field id="_22" name="flags" type="_27" context="_10" access="public" offset="64"/>
  <Field id="_23" name="str" type="_32" context="_10" access="public" offset="128"/>
  <Field id="_24" name="length" type="_33" context="_10" access="public" offset="192"/>
  <Struct id="_26" name="__va_list_tag" context="_1" location="f0:0" file="f0" line="0" members="_34 _35 _36 _37" size="192" align="64"/>
  <FundamentalType id="_27" name="int" size="32" align="32"/>
  <CvQualifiedType id="_27c" type="_27" const="1"/>
  <FundamentalType id="_28" name="void" size="0" align="8"/>
  <ReferenceType id="_29" type="_7"/>
  <ReferenceType id="_30" type="_7c"/>
  <CvQualifiedType id="_7c" type="_7" const="1"/>
  <PointerType id="_31" type="_27c"/>
  <PointerType id="_32" type="_25c"/>
  <CvQualifiedType id="_25c" type="_25" const="1"/>
  <FundamentalType id="_33" name="long int" size="64" align="64"/>
  <Field id="_34" name="gp_offset" type="_38" context="_26" access="public" offset="0"/>
  <Field id="_35" name="fp_offset" type="_38" context="_26" access="public" offset="32"/>
  <Field id="_36" name="overflow_arg_area" type="_39" context="_26" access="public" offset="64"/>
  <Field id="_37" name="reg_save_area" type="_39" context="_26" access="public" offset="128"/>
  <FundamentalType id="_38" name="unsigned int" size="32" align="32"/>
  <PointerType id="_39" type="_28"/>
  <FundamentalType id="_25" name="char" size="8" align="8"/>
  <File id="f0" name="&lt;builtin&gt;"/>
  <File id="f1" name="classes.cpp"/>
</CastXML>
